import { ServiceUpdateHistory } from '@/types/domain/updateHistory'

export const SERVICE_UPDATE_HISTORY: ServiceUpdateHistory = [
  {
    date: '2026.1.19',
    title: '아스트라 보조무기 석방 퀘스트 추가',
  },
  {
    date: '2026.1.14',
    title: '메이플 공지사항 리스트 추가',
    description: [
      '메이플 헬퍼 서비스 내에서 최근에 올라온 공지, 진행중인 이벤트를 확인할 수 있습니다.',
    ],
  },
  {
    date: '2026.1.11',
    title: '테마 변경시 반짝거리던 문제 해결',
  },
  {
    date: '2025.12.28',
    title: '메이플 헬퍼 리뉴얼 완료',
  },
  {
    date: '2025.10.23',
    title: '결정석 가격 비교 기능 추가',
    description: ['변동전 결정석 가격 전/후 를 비교할 수 있습니다.'],
  },
  {
    date: '2025.6.18',
    title: '제네시스 패스 추가',
    description: [
      '제네시스 해방 퀘스트 계산기에 패스 사용시 결과를 확인할 수 있습니다.',
    ],
  },
  {
    date: '2025.4.13',
    title: '주간 보스 계산기 캐릭터 정렬 기능 추가',
    description: [
      '등록한 주보 캐릭터들을 레벨, 전투력 순으로 정렬할 수 있습니다.',
    ],
  },
  {
    date: '2025.3.19',
    title: '데스티니 해방 퀘스트 계산기 추가',
  },
  {
    date: '2025.3.12',
    title: '주보 수익 계산기 간소화 기능 추가',
    description: [
      '선택하지 않은 보스 리스트를 보여주지 않는 기능을 추가했습니다.',
      '등록한 주보 캐릭터 정보를 간소화 하는 기능을 추가했습니다.',
    ],
  },
  {
    date: '2025.3.3',
    title: '메이플 헬퍼 디자인 리뉴얼',
  },
  {
    date: '2025.1.16',
    title: '최대 판매 가능 결정석 개수 / 캐릭당 판매 가능 개수 제한',
    description: [
      '월드당 최대 판매 가능한 결정석 개수가 90개로 제한 됩니다.',
      '캐릭당 판매 가능한 결정석 개수가 12개로 제한됩니다.',
    ],
  },
  {
    date: '2024.12.20',
    title: '제네시스 해방 퀘스트의 조건이 변경 / 서버이름 변경',
    description: ['서버 이름이 리부트 -> 에오스, 핼리오스로 변경됩니다.'],
  },
  {
    date: '2024.12.16',
    title: '이미지 해상도 개선',
    description: ['이미지의 해상도가 낮아 흐리게 보이던 현상을 수정했습니다.'],
  },
  {
    date: '2024.12.14',
    title: '제네시스 해방 퀘스트 계산기 추가',
  },
  {
    date: '2024.12.6',
    title: '보스 리스트 정렬 기능',
    description: ['가격을 기준으로 정렬하는 기능이 추가 되었습니다.'],
  },
  {
    date: '2024.12.5',
    title: '최대 판매 가능 결정석 개수 제한',
    description: ['월드당 최대 판매 가능한 결정석 개수가 180개로 제한 됩니다.'],
  },
  {
    date: '2024.12.4',
    title: '모바일 환경에 맞춘 UI 적용',
    description: [
      '모바일 환경에서도 서비스 이용이 불편하지 않도록 화면 크기에 맞춘 UI를 적용했습니다.',
    ],
  },
  {
    date: '2024.11.28',
    title: '가시성 개선 / 판매 가격 유닛 적용',
    description: [
      '등록한 캐릭터들의 ui를 변경해 가시성을 개선했습니다.',
      '판매가격을 유닛 형태로 확인할 수 있습니다.',
    ],
  },
  {
    date: '2024.11.21',
    title: '전투력 기반 주보 계산기 기능 추가',
    description: [
      '캐릭터 이름이나 api key를 등록해 간편하게 주보캐를 불러올 수 있습니다.',
    ],
  },
]
